Revit 2024 API
LayerModifier Members
The LayerModifier type exposes the following members.
Constructors
Name | Description
LayerModifier()
 Constructs a new LayerModifier with default values.
LayerModifier(ModifierType, String)
 Constructs a new LayerModifier with modifierType and separator.
Methods
Name | Description
Dispose
Releases all resources used by the LayerModifier
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ModifierType
 The modifier type of LayerModifier.
Separator
 The separator string that will follow this modifier in the export layer name.
See Also
LayerModifier Class
Autodesk.Revit.DB Namespace